; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 762370 2 3 4 5 2
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	thermograph3 - mode
	thermograph0 - mode
	infrared1 - mode
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	Planet5 - direction
	Planet6 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
)
(:goal (and
	(have_image Planet5 thermograph0)
	(have_image Planet6 thermograph3)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 2
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 2
3. (turn_to satellite1 planet6 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet6)
   goals met: 0 of 2
4. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 0 of 2
5. (turn_to satellite0 groundstation3 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 2
6. (turn_to satellite1 groundstation0 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 groundstation0)
   goals met: 0 of 2
7. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 2
8. (calibrate satellite1 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 2
9. (turn_to satellite0 planet5 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 planet5)
   goals met: 0 of 2
10. (turn_to satellite1 planet6 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet6)
   goals met: 0 of 2
11. (take_image satellite0 planet5 instrument0 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 1 of 2
12. (take_image satellite1 planet6 instrument2 thermograph3)
   added: (have_image planet6 thermograph3)
   goals met: 2 of 2
